{
  "backend/main.mo": "Main Motoko actor implementing student quiz and document management with authorization, blob storage mixins, user profiles, document metadata storage, quiz result submission, and student progress tracking with dashboard queries.",
  "feature_evidence.json": "Feature evidence report documenting four completed rebranding features: updating install button text from 'Nzeru Boost' to 'Bongo Feed', applying Malawi flag color scheme (black, red, green) throughout the application, updating CSS color variables, and configuring Tailwind with the new color theme.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages, describing routing, authentication, quiz functionality, document management, and UI components styled with Malawi flag colors (red, green, black).",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining color schemes for light and dark modes using oklch color space, with neutral grayscale values for backgrounds, foregrounds, and UI elements.",
  "frontend/index.html": "HTML entry point for the Bongo Feed application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, dashboard, documents, quiz, and results pages, wrapped in ThemeProvider and Layout with ProfileSetup modal and Toaster.",
  "frontend/src/components/AuthGuard.tsx": "Authentication guard component that checks user identity and profile status, displaying login prompt or loading spinner when unauthenticated, and rendering children when authenticated with profile.",
  "frontend/src/components/DashboardStats.tsx": "Dashboard statistics component displaying four metric cards (quizzes taken, best score, average score, progress) with icons and loading skeletons, using student dashboard data hook.",
  "frontend/src/components/DocumentList.tsx": "Displays a list of uploaded documents with metadata (filename, upload date) and a button to navigate to the quiz page for each document. Shows loading skeletons and empty states when appropriate.",
  "frontend/src/components/DocumentUpload.tsx": "Provides a drag-and-drop file upload interface with validation for file types (PDF, DOC, DOCX, TXT) and size limits (10MB). Shows upload progress and handles file submission to the backend.",
  "frontend/src/components/Footer.tsx": "Renders the application footer with copyright information and a link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Header.tsx": "Displays the main navigation header with logo, navigation links (Dashboard, My Documents), login button, and responsive mobile menu. Shows different navigation options based on authentication state.",
  "frontend/src/components/Layout.tsx": "Provides the main layout wrapper component that includes Header, Footer, and a main content area with gradient background styling.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button that manages Internet Identity authentication state, handles login errors, and clears the query cache on logout.",
  "frontend/src/components/ProfileSetup.tsx": "Shows a modal dialog for new users to enter their name during initial profile setup. The dialog cannot be dismissed until the profile is saved.",
  "frontend/src/components/QuizHistoryList.tsx": "Displays a list of completed quizzes with grades, scores, timestamps, and retry buttons. Shows color-coded grade badges and handles empty states with loading skeletons.",
  "frontend/src/components/QuizNavigation.tsx": "Renders quiz navigation UI with question progress indicators, previous/next buttons, and a submit button with confirmation dialog. Displays answered vs. total questions and allows jumping to specific questions.",
  "frontend/src/components/QuizQuestion.tsx": "Displays a single quiz question with multiple-choice options (A-D). Highlights the selected answer and allows users to select an option by clicking.",
  "frontend/src/components/QuizResults.tsx": "Shows quiz completion results with grade (A-F), score percentage, correct/incorrect counts, and detailed question review. Includes confetti animation for high scores and displays user answers vs. correct answers.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with Internet Identity authentication. Initializes access control with admin token and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current user's profile from the backend actor. Depends on the actor being available and authenticated.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Manages AuthClient creation, identity persistence, and login status states.",
  "frontend/src/hooks/useQuizState.ts": "Custom hook managing quiz navigation state including current question index, user answers, and functions to navigate between questions. Tracks which questions have been answered.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook for saving the current user's profile to the backend. Invalidates the user profile query cache on success.",
  "frontend/src/hooks/useStudentDashboard.ts": "React Query hook that fetches student dashboard data including progress information. Requires authenticated actor and identity to be available.",
  "frontend/src/hooks/useStudentDocuments.ts": "React Query hook that fetches the list of documents uploaded by the current student. Returns empty array if actor is unavailable.",
  "frontend/src/hooks/useSubmitQuizResults.ts": "React Query mutation hook for submitting quiz results (quiz ID, correct answers, total questions) to the backend. Invalidates student dashboard cache on success.",
  "frontend/src/hooks/useUploadDocument.ts": "React Query mutation hook for uploading documents with progress tracking. Converts files to base64 and stores metadata, then invalidates student documents cache on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a Malawi flag-themed color palette (red, green) for light and dark modes, plus custom animations and scrollbar styling.",
  "frontend/src/lib/utils.ts": "Utility function `cn` that merges Tailwind CSS classes using clsx and tailwind-merge for conditional and conflict-free class composition.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with React Query and Internet Identity providers wrapping the main App component.",
  "frontend/src/pages/DashboardPage.tsx": "Protected dashboard page displaying user welcome message, navigation buttons to documents/upload, dashboard statistics, and quiz history list.",
  "frontend/src/pages/DocumentsPage.tsx": "Protected documents page with a header, document upload component, and list of uploaded documents for quiz generation.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, AI-powered learning platform features, and call-to-action that redirects authenticated users to dashboard or triggers login.",
  "frontend/src/pages/QuizPage.tsx": "Quiz-taking page that displays questions with navigation, tracks answers, and submits results; currently uses mock quiz data generated from document ID.",
  "frontend/src/pages/ResultsPage.tsx": "Protected results page displaying quiz performance with detailed question review and navigation buttons to dashboard or document upload.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system with CSS variables, custom animations (accordion, slide-in, bounce), box shadows with glow effects, and integrates typography, container queries, and animate plugins.",
  "project_state.json": "Project state file for Nzeru Boost (being renamed to Bongo Feed), an educational quiz web application built with React TypeScript frontend and Motoko backend on Internet Computer, featuring document upload, AI-powered quiz generation, Internet Identity authentication, and student progress tracking."
}