{
  "backend/main.mo": "Main backend actor implementing quiz and document management with authorization, blob storage, user profiles, document upload with examination board metadata, quiz result submission, and student progress tracking.",
  "backend/migration.mo": "Migration module that transforms old document metadata to new format by adding an optional examinationBoard field set to null for existing documents.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features for examination board support: dropdown selector in upload, hook integration, display in document list, and quiz generation logic tailored to board format.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages, including examination board selector in DocumentUpload, board badges in DocumentList, and board-specific quiz generation in QuizPage.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using Malawi flag-inspired color scheme (red, green, black) for primary, secondary, and accent colors.",
  "frontend/index.html": "HTML entry point for the Bongo Feed application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, dashboard, documents, quiz, and results pages, wrapped in ThemeProvider and Layout with ProfileSetup modal and Toaster.",
  "frontend/src/components/AuthGuard.tsx": "Authentication guard component that checks user identity and profile status, displaying login prompt or loading state for unauthenticated users before rendering protected content.",
  "frontend/src/components/DashboardStats.tsx": "Dashboard statistics component displaying four metric cards (quizzes taken, best score, average score, progress) with loading skeletons and Malawi flag-themed icons.",
  "frontend/src/components/DocumentList.tsx": "Displays a list of uploaded student documents with metadata (filename, examination board, upload date) and provides a button to navigate to quiz generation for each document. Shows loading skeletons and empty states when appropriate.",
  "frontend/src/components/DocumentUpload.tsx": "Provides drag-and-drop and file input interface for uploading study materials (PDF, DOC, DOCX, TXT up to 10MB) with examination board selection. Validates file types and sizes, shows upload progress, and handles errors with toast notifications.",
  "frontend/src/components/Footer.tsx": "Renders the application footer with copyright information and a link to caffeine.ai with UTM tracking parameters based on the current hostname.",
  "frontend/src/components/Header.tsx": "Displays the main navigation header with logo, authentication-gated navigation links (Dashboard, My Documents), and a responsive mobile menu. Includes sticky positioning and backdrop blur effects.",
  "frontend/src/components/Layout.tsx": "Provides the main application layout wrapper that combines Header, Footer, and a main content area with gradient background styling.",
  "frontend/src/components/LoginButton.tsx": "Renders a login/logout button that manages Internet Identity authentication state, handles login errors, and clears the query cache on logout. Shows loading state during authentication.",
  "frontend/src/components/ProfileSetup.tsx": "Displays a modal dialog for first-time users to set up their profile by entering their name. The dialog cannot be dismissed until the profile is saved.",
  "frontend/src/components/QuizHistoryList.tsx": "Shows a list of completed quizzes with grades, scores, timestamps, and document names. Provides retry functionality and displays color-coded grade badges with sorting by most recent first.",
  "frontend/src/components/QuizNavigation.tsx": "React component that renders quiz navigation controls including a progress grid showing answered/unanswered questions, previous/next buttons, and a submit button with confirmation dialog.",
  "frontend/src/components/QuizQuestion.tsx": "React component that displays a single quiz question with multiple-choice options (A-D), highlighting the selected answer and showing question progress.",
  "frontend/src/components/QuizResults.tsx": "React component that displays quiz results with grade (A-F), score percentage, confetti animation for high scores, and a detailed review of all questions with correct/incorrect answers.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React hook that fetches the current user's profile from the backend using the actor, with automatic retry and loading state management.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and providing authentication status throughout the app.",
  "frontend/src/hooks/useQuizState.ts": "React hook that manages quiz state including current question index, user answers, and navigation functions (next, previous, go to specific question).",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React mutation hook that saves the current user's profile to the backend and invalidates the profile query cache on success.",
  "frontend/src/hooks/useStudentDashboard.ts": "React query hook that fetches student dashboard data (progress) from the backend, enabled only when authenticated with Internet Identity.",
  "frontend/src/hooks/useStudentDocuments.ts": "React query hook that fetches the list of documents uploaded by the current student from the backend.",
  "frontend/src/hooks/useSubmitQuizResults.ts": "React mutation hook that submits quiz results (quiz ID, correct answers, total questions) to the backend and invalidates the student dashboard cache.",
  "frontend/src/hooks/useUploadDocument.ts": "React mutation hook that handles document upload by converting files to base64, determining format from extension, calling the backend upload API with optional examination board, and invalidating the documents cache.",
  "frontend/src/index.css": "Global CSS file with Tailwind directives, custom CSS variables for light/dark themes using Malawi flag colors (red, green), and custom animations (slide-up, fade-in) plus scrollbar styling.",
  "frontend/src/lib/utils.ts": "Utility function that combines clsx and tailwind-merge to merge Tailwind CSS class names intelligently.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Protected dashboard page displaying user welcome message, stats component, quiz history list, and navigation buttons to documents and upload features.",
  "frontend/src/pages/DocumentsPage.tsx": "Protected page for managing study documents with upload functionality and a list view of existing documents.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature cards explaining the three-step process (upload, quiz, track), and authentication flow that redirects logged-in users to dashboard.",
  "frontend/src/pages/QuizPage.tsx": "Quiz-taking page that loads questions from backend or generates mock ABMA-format questions, manages quiz state, handles answer submission, and navigates to results page.",
  "frontend/src/pages/ResultsPage.tsx": "Protected results page displaying quiz performance with navigation options to return to dashboard or take another quiz, expects results data passed via router state.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, custom animations (accordion, slide-in, bounce), border radius variables, and shadow utilities. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file for Nzeru Boost (being renamed to Bongo Feed), an educational quiz web application built with React TypeScript frontend and Motoko backend on Internet Computer, featuring document upload, AI quiz generation, Internet Identity authentication, and student progress tracking."
}