{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add examination board format support for quiz generation",
  "requirements": [
    {
      "id": "REQ-20",
      "summary": "Add examination board selector dropdown to DocumentUpload component",
      "acceptanceCriteria": [
        "A dropdown appears in the DocumentUpload form before or after file selection",
        "Options include at least: ABMA EXAMINATION, Cambridge, IB, IGCSE, and a 'None/General' option",
        "The selected examination board is sent to the backend along with the document upload",
        "The dropdown uses the Malawi flag color scheme consistent with the app design"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DocumentUpload.tsx",
          "operation": "modify",
          "description": "Add examination board dropdown selector using shadcn/ui Select component. Include options for ABMA EXAMINATION, Cambridge, IB, IGCSE, and None/General. Position the dropdown after the file input area and before the upload button. Use state to track the selected board value and pass it to the useUploadDocument hook. Style the dropdown with Malawi flag colors (red/green theme) consistent with the existing app design."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Update useUploadDocument hook to include examination board in upload metadata",
      "acceptanceCriteria": [
        "The hook accepts examinationBoard as a parameter",
        "The examinationBoard value is included in the backend uploadDocument call",
        "The upload process completes successfully with the additional field"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useUploadDocument.ts",
          "operation": "modify",
          "description": "Extend the mutation function to accept an optional examinationBoard parameter. Pass the examinationBoard value to the backend actor.uploadDocument call, converting empty or 'None/General' selections to null. Ensure backward compatibility by treating missing examinationBoard as null."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Display examination board format in DocumentList component",
      "acceptanceCriteria": [
        "Each document in the list shows its examination board format if one was specified",
        "Documents without a specified board show 'General' or no badge",
        "The badge styling uses appropriate colors from the Malawi flag theme",
        "The examination board information is clearly visible but does not clutter the interface"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DocumentList.tsx",
          "operation": "modify",
          "description": "Add examination board badge display for each document using the examinationBoard field from ExtendedDocumentMetadata. Show a styled badge next to the filename when examinationBoard is present, displaying 'General' or omitting the badge when the field is null or undefined. Use shadcn/ui Badge component styled with Malawi flag colors (red/green) to match the app theme. Position the badge inline with the document filename without cluttering the interface."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Modify quiz generation logic to tailor questions based on examination board format",
      "acceptanceCriteria": [
        "When generating a quiz for a document with an examination board specified, the question format reflects that board's style",
        "ABMA EXAMINATION format questions follow ABMA's typical structure and terminology",
        "Questions for documents without a specified board use the current general format",
        "The quiz interface clearly indicates which examination board format is being used"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/QuizPage.tsx",
          "operation": "modify",
          "description": "Update the quiz generation logic to retrieve the examinationBoard field from the document metadata (using documentId from route params). Display the examination board format at the top of the quiz interface when present. Tailor the mock question generation to reflect ABMA EXAMINATION format characteristics (use ABMA-specific terminology and structure) when that board is selected. For documents without an examination board, continue using the existing general question format. Add a visual indicator showing which examination board format is being used for the current quiz."
        }
      ]
    }
  ]
}